apps/app/controllers/facebook_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'babar@clicklabs.in' LIMIT 1
SELECT  1 AS one FROM `users`  WHERE `users`.`email` = BINARY 'babarkhanamu@gmail.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = ?, `last_sign_in_at` = ?, `sign_in_count` = ?, `updated_at` = ? WHERE `users`.`id` = 5  [["current_sign_in_at", "2014-07-21 06:05:37"], ["last_sign_in_at", "2014-07-21 05:34:37"], ["sign_in_count", 3], ["updated_at", "2014-07-21 06:05:37"]]
INSERT INTO `users` (`created_at`, `email`, `fb_id`, `fb_token`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-21 06:27:09"], ["email", "tariq@gmail.com"], ["fb_id", "345435645656"], ["fb_token", "dxbgcvb"], ["updated_at", "2014-07-21 06:27:09"]]
---
  def create

    @user1=User.new(fb_params)
    @user2=User.find_by_email(@user1.email)
    if @user2.present? then
        #if @user2.fb_token.blank? and @user2.fb_id.blank?
          #render json: {'here'=> "ssdsdsdsds"}
         # @user2.fb_id=@user1.fb_id
         # @user2.fb_token=@user1.fb_token
         # @user2.save
          @user2.update_attributes(:fb_id=>@user1.fb_id,:fb_token=>@user1.fb_token)
          sign_in @user2,:by_pass=> true
      # end
    else
      #render json: {'here'=>@user1.fb_id}
      #@user2.fb_id=@user1.fb_id
      #@user2.fb_token=@user1.fb_token
      #@user2.email=@user1.email

      if @user1.save then