apps/app/controllers/registrations_controller.rb

INSERT INTO `users` (`access_token`, `created_at`, `email`, `encrypted_password`, `updated_at`, `username`) VALUES (?, ?, ?, ?, ?, ?)
---
 def create

		@user=User.new(registration_params)
		@str1=@user.email
		@str2=@user.password
		@user.access_token=generate_token()
		#render json: {'here'=>@user.access_token}
		 if @user.save